about.html
<!DOCTYPE html>
<html lang="en-US">
  <head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

<!-- Begin Jekyll SEO tag v2.8.0 -->
<title>Hello World! | Halfwhit</title>
<meta name="generator" content="Jekyll v3.10.0" />
<meta property="og:title" content="Hello World!" />
<meta property="og:locale" content="en_US" />
<meta name="description" content="Halfwhit’s Blog" />
<meta property="og:description" content="Halfwhit’s Blog" />
<link rel="canonical" href="https://halfwhit.github.io/about.html" />
<meta property="og:url" content="https://halfwhit.github.io/about.html" />
<meta property="og:site_name" content="Halfwhit" />
<meta property="og:type" content="website" />
<meta name="twitter:card" content="summary" />
<meta property="twitter:title" content="Hello World!" />
<!-- End Jekyll SEO tag -->

    <link rel="stylesheet" href="/assets/css/style.css?v=cc90812629116cac6b12279f9ddb3bb635dc515f">
    <!-- start custom head snippets, customize with your own _includes/head-custom.html file -->

<!-- Setup Google Analytics -->



<!-- You can set your favicon here -->
<!-- link rel="shortcut icon" type="image/x-icon" href="/favicon.ico" -->

<!-- end custom head snippets -->

  </head>
  <body>
    <div class="container-lg px-3 my-5 markdown-body">
      
      <h1><a href="https://halfwhit.github.io/">Halfwhit</a></h1>
      

      <div id="outline-container-org79736bb" class="outline-2">
<h2 id="org79736bb">Welcome</h2>
<div class="outline-text-2" id="text-org79736bb">
<p>
I am Halfwhit, and this is my personal blog. I've been toying with the idea of using blogging to help organise myself, my life, and my thoughts in addition to building out a zettlekasten inspired knowledge database.
</p>

<p>
I have a few goals throughout this endeavour, all that are closely linked. I intend to document my journey in <b>regular</b> blog posts. I'll try to keep this initial entry updated with my goals, and maybe give a bit of a retrospective if I feel my goals have been achieved.
</p>
</div>
</div>

<div id="outline-container-orgfe4ae4a" class="outline-2">
<h2 id="orgfe4ae4a">Goals</h2>
<div class="outline-text-2" id="text-orgfe4ae4a">
<ul class="org-ul">
<li>Become familiar with vim</li>
<li>Learn, live and breathe emacs in evil mode</li>
<li>Begin using org-mode and org-agenda to organise my work and personal life</li>
<li>Build out a knowledge database using org-roam</li>
<li>Construct a post-installation script for Arch Linux to set up my system with my preffered settings</li>
<li>Convert the post installation script into a customised, bootable ISO using ArchISO</li>
<li>Blog about penetration testing techniques, tactics, and maybe even some procedures</li>
</ul>
</div>
</div>

<div id="outline-container-orga42937f" class="outline-2">
<h2 id="orga42937f">Inspiration</h2>
<div class="outline-text-2" id="text-orga42937f">
<p>
A lot of the content I plan to cover in this blog is inspired by the fantastic Linux content creators out there, most notably <a href="https://youtube.com/c/DistroTube">DistroTube</a> and <a href="https://youtube.com/c/SystemCrafters">System Crafters</a>.
</p>
</div>
</div>

<div id="outline-container-org039ce36" class="outline-2">
<h2 id="org039ce36">Links</h2>
<div class="outline-text-2" id="text-org039ce36">
<ul class="org-ul">
<li><a href="https://github.com/Halfwhit">Halfwhit's GitHub</a></li>
<li><a href="https://github.com/Halfwhit/halfwhit.github.io">This site on GitHub</a></li>
</ul>
</div>
</div>


      
    </div>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/anchor-js/4.1.0/anchor.min.js" integrity="sha256-lZaRhKri35AyJSypXXs4o6OPFTbTmUoltBbDCbdzegg=" crossorigin="anonymous"></script>
    <script>anchors.add();</script>
  </body>
</html>
